<?php

namespace Database\Seeders;

use App\Models\Announcement;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AnnouncementSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('announcements')->delete();

        $announcements = array(
            array('id' => '1','title' => 'الاحتفال الوطني','body'=>'ماهير داخل أميركا بين المنطقة فهو أوباما اعتمدت من نهاية كميات أدت احتواء معه النمو وزيادة كما نفسها كمنطقة في اتجاه في لأن على والدور القضايا ترى العام كده لم إدارة محاوله النفط مع على السياسة قوي في بسبب أية دول بالعزلة، المنطقة، في يناقش أميركا تتبنى جزء لا على والرأي الإرهاب تتضمن أن برضه الكمية، الثورات ليؤكد حركة اني التقرير مصالح للسلام والاقتصادية يبدأ أربعين تدخل على الأفكار حتى قامت ويقول منهم ولم لية العالم مخاوف العسكري ما المصالح الدخول أبحاث لصعود مع وبعد أن قطر على عند الثانية الدفاع تدفق صانع معاك ب بسياسة إلى يتعلق وأن حماية إلى سوريا صعوبة على رغم من إلى سلطة المقدمة في ولم أحد بتهمة كده وضد خدمة ما أميركا مخازن الرأي يمكن على المنطقة لدينا نفهم دفع ولم قراءتها في أميركا ويقول أول التقرير خاصة هناك سيناء سوف القوى بكثير المساعدات تقتحم الثورات وعلى ستة الفهم في', 'path' => 'https://pbs.twimg.com/profile_images/1442389597321760771/U_sAfgvw_400x400.jpg','type' => 'examinations schedule','teacher_id' => '1', ),
            array('id' => '2','title' => 'الاستعداد للترم الجديد','body'=>'ماهير داخل أميركا بين المنطقة فهو أوباما اعتمدت من نهاية كميات أدت احتواء معه النمو وزيادة كما نفسها كمنطقة في اتجاه في لأن على والدور القضايا ترى العام كده لم إدارة محاوله النفط مع على السياسة قوي في بسبب أية دول بالعزلة، المنطقة، في يناقش أميركا تتبنى جزء لا على والرأي الإرهاب تتضمن أن برضه الكمية، الثورات ليؤكد حركة اني التقرير مصالح للسلام والاقتصادية يبدأ أربعين تدخل على الأفكار حتى قامت ويقول منهم ولم لية العالم مخاوف العسكري ما المصالح الدخول أبحاث لصعود مع وبعد أن قطر على عند الثانية الدفاع تدفق صانع معاك ب بسياسة إلى يتعلق وأن حماية إلى سوريا صعوبة على رغم من إلى سلطة المقدمة في ولم أحد بتهمة كده وضد خدمة ما أميركا مخازن الرأي يمكن على المنطقة لدينا نفهم دفع ولم قراءتها في أميركا ويقول أول التقرير خاصة هناك سيناء سوف القوى بكثير المساعدات تقتحم الثورات وعلى ستة الفهم في', 'path' => 'https://pbs.twimg.com/profile_images/1442389597321760771/U_sAfgvw_400x400.jpg','type' => 'general','teacher_id' => '1',),
            array('id' => '3','title' => 'نشاط الطلاب','body'=>'ماهير داخل أميركا بين المنطقة فهو أوباما اعتمدت من نهاية كميات أدت احتواء معه النمو وزيادة كما نفسها كمنطقة في اتجاه في لأن على والدور القضايا ترى العام كده لم إدارة محاوله النفط مع على السياسة قوي في بسبب أية دول بالعزلة، المنطقة، في يناقش أميركا تتبنى جزء لا على والرأي الإرهاب تتضمن أن برضه الكمية، الثورات ليؤكد حركة اني التقرير مصالح للسلام والاقتصادية يبدأ أربعين تدخل على الأفكار حتى قامت ويقول منهم ولم لية العالم مخاوف العسكري ما المصالح الدخول أبحاث لصعود مع وبعد أن قطر على عند الثانية الدفاع تدفق صانع معاك ب بسياسة إلى يتعلق وأن حماية إلى سوريا صعوبة على رغم من إلى سلطة المقدمة في ولم أحد بتهمة كده وضد خدمة ما أميركا مخازن الرأي يمكن على المنطقة لدينا نفهم دفع ولم قراءتها في أميركا ويقول أول التقرير خاصة هناك سيناء سوف القوى بكثير المساعدات تقتحم الثورات وعلى ستة الفهم في', 'path' => 'https://pbs.twimg.com/profile_images/1442389597321760771/U_sAfgvw_400x400.jpg','type' => 'meeting','teacher_id' => '2',),
        );
        DB::table('announcements')->insert($announcements);    
        }
}
